---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.IndexTriangle.Index0
source: html/41858f9d-1c2a-5f7e-c262-34f600e433e1.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexTriangle.Index0 Property

The index of the triangle's first vertex.

## Syntax (C#)
```csharp
public int Index0 { get; set; }
```